{"rules":{"apis-json-apis-aid-error":{"description":"Every API should have a unique identifier, known as an AID (API Identifier). The APIs.json file, contract, or collection contains its own AID, which the API uses as part of its reference. Additionally, the API applies a slugified version of its name, resulting in a unique, human-readable identifier for the API.","message":"APIs MUST have an aid property.","given":"$.apis.*","severity":"error","then":{"field":"aid","function":"truthy"}},"apis-json-apis-aid-info":{"description":"Every API should have a unique identifier, known as an AID (API Identifier). The APIs.json file, contract, or collection contains its own AID, which the API uses as part of its reference. Additionally, the API applies a slugified version of its name, resulting in a unique, human-readable identifier for the API.","message":"APIs MUST have an aid property.","given":"$.apis.*","severity":"info","then":{"field":"aid","function":"falsy"}},"apis-json-apis-baseURL-error":{"description":"Each API defined within an APIs.json artifact can specify the base URL for the API. This URL serves as a reference point for developers during onboarding and when making API calls. Additionally, it helps identify the API and validate the domain it is associated with.","message":"APIs MUST Have a Base URL","given":"$.apis.*","severity":"error","then":{"field":"baseURL","function":"truthy"}},"apis-json-apis-baseURL-info":{"description":"Each API defined within an APIs.json artifact can specify the base URL for the API. This URL serves as a reference point for developers during onboarding and when making API calls. Additionally, it helps identify the API and validate the domain it is associated with.","message":"APIs Has a Base URL","given":"$.apis.*","severity":"info","then":{"field":"baseURL","function":"falsy"}},"apis-json-apis-contact-email-error":{"description":"The contact object in an APIs.json file allows for referencing the email address of a person or group. This property provides a convenient way for users to seek support for an API, using email as the default method to reach the team managing the API in production.","message":"API contact COULD have email.","given":"$.apis.*.contact.*","severity":"error","then":{"field":"email","function":"truthy"}},"apis-json-apis-contact-email-info":{"description":"The contact object in an APIs.json file allows for referencing the email address of a person or group. This property provides a convenient way for users to seek support for an API, using email as the default method to reach the team managing the API in production.","message":"API contact has email.","given":"$.apis.*.contact.*","severity":"info","then":{"field":"email","function":"falsy"}},"apis-json-apis-contact-error":{"description":"The contact object in an APIs.json file allows for associating a vCard that represents an individual or organizational entity. It includes common contact information such as a name, email, or other references, offering a standardized method for providing support for an API.","message":"API COULD have a contact.","severity":"warn","given":"$.apis.*","then":{"field":"contact","function":"truthy"}},"apis-json-apis-contact-fn-error":{"description":"The contact object in an APIs.json file includes a full name (FN) property, which specifies the formatted text corresponding to the contact name in the vCard for an API. This provides a quick and clear way to assign a person, group, or other point of contact to an API for addressing questions and providing support.","message":"Contact Could Have FN","given":"$.apis.*.contact.*","severity":"error","then":{"field":"FN","function":"truthy"}},"apis-json-apis-contact-fn-info":{"description":"The contact object in an APIs.json file includes a full name (FN) property, which specifies the formatted text corresponding to the contact name in the vCard for an API. This provides a quick and clear way to assign a person, group, or other point of contact to an API for addressing questions and providing support.","message":"Contact Has FN","given":"$.apis.*.contact.*","severity":"info","then":{"field":"FN","function":"falsy"}},"apis-json-apis-contact-info":{"description":"The contact object in an APIs.json file allows for associating a vCard that represents an individual or organizational entity. It includes common contact information such as a name, email, or other references, offering a standardized method for providing support for an API.","message":"Has a Contract","severity":"info","given":["$.apis.*.properties.*","$.common.*"],"then":{"field":"contact","function":"falsy"}},"apis-json-apis-description-info":{"description":"Each API included in an APIs.json file should have a 1-3 paragraph description. This description serves as the first impression for potential consumers and is often displayed in portals, networks, search results, and other discovery channels. A well-crafted description plays a key role in helping API consumers understand and onboard with the API effectively.","message":"Has a Description","given":"$.apis.*","severity":"info","then":{"field":"description","function":"falsy"}},"apis-json-apis-humanURL-info":{"description":"The humanURL property for each API defined in an APIs.json contract provides a link for business or technical consumers to learn more about the API. This URL can direct users to a portal, documentation, or ideally, a dedicated landing page designed specifically to onboard consumers with a single API.","message":"Has a Human URL","given":"$.apis.*","severity":"info","then":{"field":"humanURL","function":"falsy"}},"apis-json-apis-image-info":{"description":"Each API defined within an APIs.json file can include a dedicated image, offering a visual representation of the resource or capability it provides. This enhances the API's approachability and visual appeal in portals, documentation, catalogs, and marketplaces, making it more engaging for potential users.","message":"Has an Image","given":"$.apis.*","severity":"info","then":{"field":"image","function":"falsy"}},"apis-json-apis-info":{"description":"The APIs property in an APIs.json file enables the definition of one or more APIs as part of a larger collection. Each API within this property has its own subset of metadata, allowing it to be uniquely identified and distinguished from the rest of the collection. This individual metadata contributes to the overall value and functionality of the API collection.","message":"Has APIs","given":"$","severity":"info","then":{"field":"apis","function":"falsy"}},"apis-json-apis-name-info":{"description":"Each individual API in an APIs.json collection has its own name property, allowing for a clear description of the API. This name might match the API's title in the OpenAPI Info section, but it could also represent the API's business purpose, as displayed in catalogs and search results.","message":"Has a Name","given":"$.apis.*","severity":"info","then":{"field":"name","function":"falsy"}},"apis-json-apis-properties-about-info":{"description":"Each individual API included in an APIs.json file can have a properties collection, which contains specific properties relevant to that API. These properties often start with human-readable elements, such as documentation links, and can also include machine-readable properties to enhance functionality and integration.","message":"Has About","severity":"info","given":["$.apis.*.properties.*","$.common.*"],"then":[{"field":"type","function":"pattern","functionOptions":{"notMatch":"\\b(about|About)\\b"}}]},"apis-json-common-info":{"description":"An APIs.json artifact can include a set of common properties that describe aspects of API operations shared across multiple APIs in a collection. These common properties are typically managed by a centralized platform team, ensuring consistency and reducing the burden on individual teams. This allows API teams to focus on delivering the unique value of their APIs rather than duplicating efforts on shared operational elements.","message":"There is an common property.","given":"$","severity":"info","then":{"field":"common","function":"falsy"}},"apis-json-created-info":{"description":"The created property in an APIs.json contract might seem like a minor detail, but it serves an important purpose by providing a timestamp that marks the origin of the intent to offer an interface for business purposes. This property offers a straightforward reference to indicate the age and potentially the maturity of a collection of APIs being used in business operations.","message":"There is a created date.","given":"$","severity":"info","then":{"field":"created","function":"falsy"}},"apis-json-description-info":{"description":"Every collection of APIs defined in APIs.json should include a one- or two-paragraph description outlining the purpose of the APIs. While individual APIs should have their own descriptions, the collection’s description should focus on the overall business purpose and the domain in which the APIs are intended to be used.","message":"There is a description.","given":"$","severity":"info","then":{"field":"description","function":"falsy"}},"apis-json-image-info":{"description":"Images for APIs","message":"APIs.json contracts are often used to power discover and distribute as part of API catalogs and marketplaces. These are places where having a visual representation matching the purpose of a collection of APIs helps with discovery and onboarding, allowing some APIs to stand out and make a good first impression on consumers.","given":"$","severity":"info","then":{"field":"image","function":"falsy"}},"apis-json-modified-info":{"description":"The modified property in an APIs.json collection indicates the most recent updates made to a group of APIs. While detailed change logs can provide more specifics, an accurate and up-to-date modified timestamp is essential for tracking and managing changes effectively across operations.","message":"There is a modified date.","given":"$","severity":"info","then":{"field":"modified","function":"falsy"}},"apis-json-name-info":{"description":"The name of an APIs","message":"The name of a collection of APIs should describe their purpose, target audience, and the problems they aim to solve. While individual APIs should have their own specific names, the name in the APIs.json file should provide a higher-level description, emphasizing the overarching business purpose of the APIs.","given":"$","severity":"info","then":{"field":"name","function":"falsy"}},"apis-json-specification-aid-info":{"description":"Every collection of APIs should have a unique identifier. This unique API identifier, or AID, serves as a human and machine-readable reference for organizing and managing various APIs. Similar to a barcode, a unique identifier helps track APIs, whether you are discovering them or putting them to use.","message":"There is an aid.","severity":"info","given":"$","then":{"field":"aid","function":"falsy"}},"apis-json-specification-type-info":{"description":"The type property in an APIs.json file classifies the business contracts for different types of API collections. It can represent a simple index for a single API, a template or example to showcase possibilities, or classifications such as contract, search, and network to address specific business or discovery purposes.","message":"There is a specification type.","severity":"info","given":"$","then":{"field":"type","function":"falsy"}},"apis-json-specification-version-info":{"description":"The specification version of an APIs.json collection indicates which version of the APIs.json specification is being used. This ensures compatibility and allows for the validation of new properties. While property types are the most common additions, new top-level elements are also being introduced. Proper governance ensures that the correct version of the specification is applied.","message":"There is a specification version.","severity":"info","given":"$","then":{"field":"specificationVersion","function":"falsy"}},"apis-json-tags-info":{"description":"Each collection of APIs defined in an APIs.json artifact includes a property for adding one or more tags. These tags provide additional context about the resources or capabilities offered as part of the collection of APIs, highlighting its business value and the domain in which it is applied.","message":"There is a Tags Object","given":"$","severity":"info","then":{"field":"tags","function":"falsy"}},"apis-json-url-info":{"description":"The top-level URL in an APIs.json file contains a fully qualified link to where the APIs.json file is published. This URL serves as a reference for the API collection and can also be validated. When an APIs.json file includes URLs to various properties, it can be verified against the top-level domain, ensuring the creation of an authoritative APIs.json artifact.","message":"There is a URL.","given":"$","severity":"info","then":{"field":"url","function":"falsy"}}}}